BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny20.PIC
        <edc:SFRDef edc:_addr="0x23" edc:access="nn-nnnnn" edc:cname="TCCR1B" edc:impl="0xDF" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="Clock Select1 bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No Clock Source (Stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Running, No Prescaling" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Running, CLK/8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Running, CLK/64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Running, CLK/256" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Running, CLK/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Running, ExtClk Tx Falling Edge" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Running, ExtClk Tx Rising Edge" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM1" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES1" edc:desc="Input Capture 1 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC1" edc:desc="Input Capture 1 Noise Canceler" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x24" edc:access="nnnn--nn" edc:cname="TCCR1A" edc:impl="0xF3" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="WGM1" edc:desc="Waveform Generation Mode Bits" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="COM1B" edc:desc="Compare Output Mode 1B, bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="COM1A" edc:desc="Compare Output Mode 1A, bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x25" edc:access="n-nnnnnn" edc:cname="TIFR" edc:impl="0xBF" edc:nzwidth="0x8" ltx:memberofperipheral="TC0 TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TOV" edc:desc="Timer Overflow Flag" edc:mask="0x9" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="OCF0A" edc:desc="Output Compare Flag 0 A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF0B" edc:desc="Output Compare Flag 0 B" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1A" edc:desc="Timer Output Compare Flag 1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1B" edc:desc="Timer Output Compare Flag 1B" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICF1" edc:desc="Input Capture Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="TOV" edc:desc="Timer Overflow Flag" edc:mask="0x9" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="OCF0A" edc:desc="Output Compare Flag 0 A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF0B" edc:desc="Output Compare Flag 0 B" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1A" edc:desc="Timer Output Compare Flag 1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1B" edc:desc="Timer Output Compare Flag 1B" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICF1" edc:desc="Input Capture Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x26" edc:access="n-nnnnnn" edc:cname="TIMSK" edc:impl="0xBF" edc:nzwidth="0x8" ltx:memberofperipheral="TC0 TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TOIE" edc:desc="Overflow Interrupt Enable" edc:mask="0x9" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="OCIE0A" edc:desc="Timer/Counter0 Output Compare Match A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE0B" edc:desc="Timer/Counter Output Compare Match B Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1A" edc:desc="Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1B" edc:desc="Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE1" edc:desc="Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="TOIE" edc:desc="Overflow Interrupt Enable" edc:mask="0x9" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="OCIE0A" edc:desc="Timer/Counter0 Output Compare Match A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE0B" edc:desc="Timer/Counter Output Compare Match B Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1A" edc:desc="Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1B" edc:desc="Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE1" edc:desc="Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x27" edc:access="n------n" edc:cname="GTCCR" edc:impl="0x81" edc:nzwidth="0x8" ltx:memberofperipheral="TC0 TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="PSR" edc:desc="Prescaler Reset" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="TSM" edc:desc="Timer Synchronization Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="PSR" edc:desc="Prescaler Reset" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="TSM" edc:desc="Timer Synchronization Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x28" edc:access="nnnnnnnn" edc:cname="TWSD" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWSD" edc:desc="TWI slave data bit" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x29" edc:access="nnnnnnnn" edc:cname="TWSAM" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0x2A" edc:access="nnnnnnnn" edc:cname="TWSA" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWSA" edc:desc="TWI slave address bit" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x2B" edc:access="nnnnnnnn" edc:cname="TWSSRA" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWAS" edc:desc="TWI Address or Stop" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIR" edc:desc="TWI Read/Write Direction" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBE" edc:desc="TWI Bus Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWC" edc:desc="TWI Collision" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWRA" edc:desc="TWI Receive Acknowledge" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWCH" edc:desc="TWI Clock Hold" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWASIF" edc:desc="TWI Address/Stop Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIF" edc:desc="TWI Data Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x2C" edc:access="-----nnn" edc:cname="TWSCRB" edc:impl="0x7" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWCMD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TWAA" edc:desc="TWI Acknowledge Action" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x2D" edc:access="n-nnnnnn" edc:cname="TWSCRA" edc:impl="0xBF" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWSME" edc:desc="TWI Smart Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWPME" edc:desc="TWI Promiscuous Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSIE" edc:desc="TWI Stop Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEN" edc:desc="Two-Wire Interface Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWASIE" edc:desc="TWI Address/Stop Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIE" edc:desc="TWI Data Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSHE" edc:desc="TWI SDA Hold Time Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x2E" edc:access="nnnnnnnn" edc:cname="SPDR" edc:nzwidth="0x8" ltx:memberofperipheral="SPI"/>
        <edc:SFRDef edc:_addr="0x2F" edc:access="nn-----n" edc:cname="SPSR" edc:impl="0xC1" edc:nzwidth="0x8" ltx:memberofperipheral="SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
              <edc:SFRFieldDef edc:cname="SPI2X" edc:desc="Double SPI Speed Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="Write Collision Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIF" edc:desc="SPI Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
